# Investiagating School Data

*Disclaimer: This project is based on the data cleaning walkthrough provided by dataquest.io. Though my own take on this project might differ from what can be found on their website.*

### The Project
In this project I will try to showcase my skills in data cleaning, data exploration and presentation. While I will perform some analyses on this project, they will remain at a lower level of complexity. If you want to see my performance on more complex issues, I would refer you to my other projects.

### The Question
In this project, I will try to investigate whether standardized testing in U.S. highschools is efficiant and if certain groups are at a disadvantage.  

### The Data
In order to answer said question, I am going to use publicly accessible SAT data from 2012 from the city of New York. In order to investigate demographics I need more data though. Here's a list of all datasets I am going to use:

* [SAT scores by school](https://data.cityofnewyork.us/Education/2012-SAT-Results/f9bf-2cp4) - SAT scores for each high school in New York City
* [School attendance](https://data.cityofnewyork.us/Education/2010-2011-School-Attendance-and-Enrollment-Statist/7z8d-msnt) - Attendance information for each school in New York City
* [Class size](https://data.cityofnewyork.us/Education/2010-2011-Class-Size-School-level-detail/urz7-pzb3) - Information on class size for each school
* [AP test results](https://data.cityofnewyork.us/Education/AP-College-Board-2010-School-Level-Results/itfs-ms3e) - Advanced Placement (AP) exam results for each high school (passing an optional AP exam in a particular subject can earn a student college credit in that subject)
* [Graduation outcomes](https://data.cityofnewyork.us/Education/2005-2010-Graduation-Outcomes-School-Level/vh2h-md7a) - The percentage of students who graduated, and other outcome information
* [Demographics](https://data.cityofnewyork.us/Education/2006-2012-School-Demographics-and-Accountability-S/ihfw-zy9j) - Demographic information for each school
* [School survey](https://data.cityofnewyork.us/Education/2011-NYC-School-Survey/mnz3-dyi8) - Surveys of parents, teachers, and students at each school

## Reading the Data

In [318]:
#read in the csv files
import pandas as pd
data_files = ["ap_2010.csv",
    "class_size.csv",
    "demographics.csv",
    "graduation.csv",
    "hs_directory.csv",
    "sat_results.csv"
]
data = {}
for f in data_files:
    d = pd.read_csv('data/{}'.format(f))
    key_name = f.replace('.csv', '')
    data[key_name] = d

In [319]:
data['sat_results'].head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

In [320]:
for c in data:
    print(data[c].head())

      DBN                             SchoolName  AP Test Takers   \
0  01M448           UNIVERSITY NEIGHBORHOOD H.S.             39.0
1  01M450                 EAST SIDE COMMUNITY HS             19.0
2  01M515                    LOWER EASTSIDE PREP             24.0
3  01M539         NEW EXPLORATIONS SCI,TECH,MATH            255.0
4  02M296  High School of Hospitality Management              NaN

   Total Exams Taken  Number of Exams with scores 3 4 or 5
0               49.0                                  10.0
1               21.0                                   NaN
2               26.0                                  24.0
3              377.0                                 191.0
4                NaN                                   NaN
   CSD BOROUGH SCHOOL CODE                SCHOOL NAME GRADE  PROGRAM TYPE  \
0    1       M        M015  P.S. 015 Roberto Clemente     0K       GEN ED
1    1       M        M015  P.S. 015 Roberto Clemente     0K          CTT
2    1       M        M015  P.S. 015 Roberto Clemente     01       GEN ED
3    1       M        M015  P.S. 015 Roberto Clemente     01          CTT
4    1       M        M015  P.S. 015 Roberto Clemente     02       GEN ED

  CORE SUBJECT (MS CORE and 9-12 ONLY) CORE COURSE (MS CORE and 9-12 ONLY)  \
0                                    -                                   -
1                                    -                                   -
2                                    -                                   -
3                                    -                                   -
4                                    -                                   -

  SERVICE CATEGORY(K-9* ONLY)  NUMBER OF STUDENTS / SEATS FILLED  \
0                           -                               19.0
1                           -                               21.0
2                           -                               17.0
3                           -                               17.0
4                           -                               15.0

   NUMBER OF SECTIONS  AVERAGE CLASS SIZE  SIZE OF SMALLEST CLASS  \
0                 1.0                19.0                    19.0
1                 1.0                21.0                    21.0
2                 1.0                17.0                    17.0
3                 1.0                17.0                    17.0
4                 1.0                15.0                    15.0

   SIZE OF LARGEST CLASS DATA SOURCE  SCHOOLWIDE PUPIL-TEACHER RATIO
0                   19.0         ATS                             NaN
1                   21.0         ATS                             NaN
2                   17.0         ATS                             NaN
3                   17.0         ATS                             NaN
4                   15.0         ATS                             NaN
      DBN                       Name  schoolyear fl_percent  frl_percent  \
0  01M015  P.S. 015 ROBERTO CLEMENTE    20052006       89.4          NaN
1  01M015  P.S. 015 ROBERTO CLEMENTE    20062007       89.4          NaN
2  01M015  P.S. 015 ROBERTO CLEMENTE    20072008       89.4          NaN
3  01M015  P.S. 015 ROBERTO CLEMENTE    20082009       89.4          NaN
4  01M015  P.S. 015 ROBERTO CLEMENTE    20092010                    96.5

   total_enrollment prek   k grade1 grade2  ... black_num black_per  \
0               281   15  36     40     33  ...        74      26.3
1               243   15  29     39     38  ...        68      28.0
2               261   18  43     39     36  ...        77      29.5
3               252   17  37     44     32  ...        75      29.8
4               208   16  40     28     32  ...        67      32.2

  hispanic_num hispanic_per white_num white_per male_num male_per female_num  \
0          189         67.3         5       1.8    158.0     56.2      123.0
1          153         63.0         4       1.6    140.0     57.6      103.0
2          157         60.2         7       2.7    143.0     54.8      118.0
3          149         59.1         7       2.8    149.0     59.1      103.0
4          118         56.7         6       2.9    124.0     59.6       84.0

  female_per
0       43.8
1       42.4
2       45.2
3       40.9
4       40.4

[5 rows x 38 columns]
    Demographic     DBN                            School Name    Cohort  \
0  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2003
1  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2004
2  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2005
3  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2006
4  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL  2006 Aug

   Total Cohort Total Grads - n  Total Grads - % of cohort Total Regents - n  \
0             5               s                        NaN                 s
1            55              37                       67.3                17
2            64              43                       67.2                27
3            78              43                       55.1                36
4            78              44                       56.4                37

   Total Regents - % of cohort  Total Regents - % of grads  ...  \
0                          NaN                         NaN  ...
1                         30.9                        45.9  ...
2                         42.2                        62.8  ...
3                         46.2                        83.7  ...
4                         47.4                        84.1  ...

  Regents w/o Advanced - n  Regents w/o Advanced - % of cohort  \
0                        s                                 NaN
1                       17                                30.9
2                       27                                42.2
3                       36                                46.2
4                       37                                47.4

   Regents w/o Advanced - % of grads Local - n  Local - % of cohort  \
0                                NaN         s                  NaN
1                               45.9        20                 36.4
2                               62.8        16                 25.0
3                               83.7         7                  9.0
4                               84.1         7                  9.0

   Local - % of grads Still Enrolled - n  Still Enrolled - % of cohort  \
0                 NaN                  s                           NaN
1                54.1                 15                          27.3
2                37.2                  9                          14.1
3                16.3                 16                          20.5
4                15.9                 15                          19.2

   Dropped Out - n Dropped Out - % of cohort
0                s                       NaN
1                3                       5.5
2                9                      14.1
3               11                      14.1
4               11                      14.1

[5 rows x 23 columns]
      dbn                                        school_name    borough  \
0  27Q260          Frederick Douglass Academy VI High School     Queens
1  21K559        Life Academy High School for Film and Music   Brooklyn
2  16K393     Frederick Douglass Academy IV Secondary School   Brooklyn
3  08X305                               Pablo Neruda Academy      Bronx
4  03M485  Fiorello H. LaGuardia High School of Music & A...  Manhattan

  building_code  phone_number    fax_number  grade_span_min  grade_span_max  \
0          Q465  718-471-2154  718-471-2890             9.0              12
1          K400  718-333-7750  718-333-7775             9.0              12
2          K026  718-574-2820  718-574-2821             9.0              12
3          X450  718-824-1682  718-824-1663             9.0              12
4          M485  212-496-0700  212-724-5748             9.0              12

   expgrade_span_min  expgrade_span_max  ... priority08 priority09 priority10  \
0                NaN                NaN  ...        NaN        NaN        NaN
1                NaN                NaN  ...        NaN        NaN        NaN
2                NaN                NaN  ...        NaN        NaN        NaN
3                NaN                NaN  ...        NaN        NaN        NaN
4                NaN                NaN  ...        NaN        NaN        NaN

                                          Location 1 Community Board  \
0  8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...            14.0
1  2630 Benson Avenue\nBrooklyn, NY 11214\n(40.59...            13.0
2  1014 Lafayette Avenue\nBrooklyn, NY 11221\n(40...             3.0
3  1980 Lafayette Avenue\nBronx, NY 10473\n(40.82...             9.0
4  100 Amsterdam Avenue\nNew York, NY 10023\n(40....             7.0

   Council District Census Tract        BIN           BBL  \
0              31.0     100802.0  4300730.0  4.157360e+09
1              47.0        306.0  3186454.0  3.068830e+09
2              36.0        291.0  3393805.0  3.016160e+09
3              18.0         16.0  2022205.0  2.036040e+09
4               6.0        151.0  1030341.0  1.011560e+09

                                                 NTA
0  Far Rockaway-Bayswater                        ...
1  Gravesend                                     ...
2  Stuyvesant Heights                            ...
3  Soundview-Castle Hill-Clason Point-Harding Par...
4  Lincoln Square                                ...

[5 rows x 64 columns]
      DBN                                    SCHOOL NAME  \
0  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448            UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                     EAST SIDE COMMUNITY SCHOOL
3  01M458                      FORSYTH SATELLITE ACADEMY
4  01M509                        MARTA VALLE HIGH SCHOOL

  Num of SAT Test Takers SAT Critical Reading Avg. Score SAT Math Avg. Score  \
0                     29                             355                 404
1                     91                             383                 423
2                     70                             377                 402
3                      7                             414                 401
4                     44                             390                 433

  SAT Writing Avg. Score
0                    363
1                    366
2                    370
3                    359
4                    384

In [321]:
# reading in the survey files

all_survey = pd.read_csv('data/survey_all.txt', delimiter='\t', encoding='windows-1252')
d75_survey = pd.read_csv('data/survey_d75.txt', delimiter='\t', encoding='windows-1252')

In [322]:
survey = pd.concat([all_survey, d75_survey], axis=0)
survey.head()

,dbn,bn,schoolname,d75,studentssurveyed,highschool,schooltype,rr_s,rr_t,rr_p,...,s_q14_2,s_q14_3,s_q14_4,s_q14_5,s_q14_6,s_q14_7,s_q14_8,s_q14_9,s_q14_10,s_q14_11
0,01M015,M015,P.S. 015 Roberto Clemente,0,No,0.0,Elementary School,NaN,88,60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,01M019,M019,P.S. 019 Asher Levy,0,No,0.0,Elementary School,NaN,100,60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,01M020,M020,P.S. 020 Anna Silver,0,No,0.0,Elementary School,NaN,88,73,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,01M034,M034,P.S. 034 Franklin D. Roosevelt,0,Yes,0.0,Elementary / Middle School,89.0,73,50,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,01M063,M063,P.S. 063 William McKinley,0,No,0.0,Elementary School,NaN,100,60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Most of the data displayed is not of interest for us. It seems the most interesting columns for us, according to the dictionary available at the source of the data are:

\["dbn", "rr_s", "rr_t", "rr_p", "N_s", "N_t", "N_p", "saf_p_11", "com_p_11", "eng_p_11", "aca_p_11", "saf_t_11", "com_t_11", "eng_t_11", "aca_t_11", "saf_s_11", "com_s_11", "eng_s_11", "aca_s_11", "saf_tot_11", "com_tot_11", "eng_tot_11", "aca_tot_11"\]

We want to filter the data and also change the name of the column 'dbn' to 'DBN' to match our other datasets.

In [323]:
survey['DBN'] = survey['dbn']

In [324]:
survey.head()

,dbn,bn,schoolname,d75,studentssurveyed,highschool,schooltype,rr_s,rr_t,rr_p,...,s_q14_3,s_q14_4,s_q14_5,s_q14_6,s_q14_7,s_q14_8,s_q14_9,s_q14_10,s_q14_11,DBN
0,01M015,M015,P.S. 015 Roberto Clemente,0,No,0.0,Elementary School,NaN,88,60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,01M015
1,01M019,M019,P.S. 019 Asher Levy,0,No,0.0,Elementary School,NaN,100,60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,01M019
2,01M020,M020,P.S. 020 Anna Silver,0,No,0.0,Elementary School,NaN,88,73,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,01M020
3,01M034,M034,P.S. 034 Franklin D. Roosevelt,0,Yes,0.0,Elementary / Middle School,89.0,73,50,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,01M034
4,01M063,M063,P.S. 063 William McKinley,0,No,0.0,Elementary School,NaN,100,60,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,01M063

In [325]:
target_fields =[
"dbn", "rr_s", "rr_t", "rr_p", "N_s", "N_t", "N_p", "saf_p_11", "com_p_11", "eng_p_11", "aca_p_11", "saf_t_11", "com_t_11", "eng_t_11", "aca_t_11", "saf_s_11", "com_s_11", "eng_s_11", "aca_s_11", "saf_tot_11", "com_tot_11", "eng_tot_11", "aca_tot_11"
]

data['survey'] = survey.loc[:, target_fields]

In [326]:
data['survey']

,dbn,rr_s,rr_t,rr_p,N_s,N_t,N_p,saf_p_11,com_p_11,eng_p_11,...,eng_t_11,aca_t_11,saf_s_11,com_s_11,eng_s_11,aca_s_11,saf_tot_11,com_tot_11,eng_tot_11,aca_tot_11
0,01M015,NaN,88,60,NaN,22.0,90.0,8.5,7.6,7.5,...,7.6,7.9,NaN,NaN,NaN,NaN,8.0,7.7,7.5,7.9
1,01M019,NaN,100,60,NaN,34.0,161.0,8.4,7.6,7.6,...,8.9,9.1,NaN,NaN,NaN,NaN,8.5,8.1,8.2,8.4
2,01M020,NaN,88,73,NaN,42.0,367.0,8.9,8.3,8.3,...,6.8,7.5,NaN,NaN,NaN,NaN,8.2,7.3,7.5,8.0
3,01M034,89.0,73,50,145.0,29.0,151.0,8.8,8.2,8.0,...,6.8,7.8,6.2,5.9,6.5,7.4,7.3,6.7,7.1,7.9
4,01M063,NaN,100,60,NaN,23.0,90.0,8.7,7.9,8.1,...,7.8,8.1,NaN,NaN,NaN,NaN,8.5,7.6,7.9,8.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
51,75X352,90.0,58,48,38.0,46.0,160.0,8.9,8.3,7.9,...,5.7,5.8,6.8,6.0,7.8,7.6,7.4,6.6,7.1,7.2
52,75X721,84.0,90,48,237.0,82.0,239.0,8.6,7.6,7.5,...,6.7,7.0,7.8,7.2,7.8,7.9,8.0,7.1,7.3,7.6
53,75X723,77.0,74,20,103.0,69.0,74.0,8.4,7.8,7.8,...,6.7,7.6,6.7,7.2,7.7,7.7,7.6,7.4,7.4,7.7
54,75X754,63.0,93,22,336.0,82.0,124.0,8.3,7.5,7.5,...,6.6,7.1,6.8,6.6,7.6,7.7,7.2,6.9,7.3,7.5
55,75X811,38.0,63,19,44.0,71.0,119.0,8.5,7.8,7.7,...,6.5,7.0,7.7,6.1,7.7,7.7,7.7,6.8,7.3,7.5

## Insert DBN Fields

Almost all of our datasets contain the column 'DBN' so that is a great column to later merge the data on. Some datasets do not contain said field though, so I need to make up for that. Since DBN is just the padded CSD plus the School Code like in the 'class_size' dataset I can combine those two columns.

In [327]:
data['hs_directory']['DBN'] = data['hs_directory']['dbn']

# define function to create padded CSDs
def pad_csd(num):
    return str(num).zfill(2)
data["class_size"]["padded_csd"] = data["class_size"]["CSD"].apply(pad_csd)

In [328]:
data["class_size"].head()

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd
0,1,M,M015,P.S. 015 Roberto Clemente,0K,GEN ED,-,-,-,19.0,1.0,19.0,19.0,19.0,ATS,NaN,01
1,1,M,M015,P.S. 015 Roberto Clemente,0K,CTT,-,-,-,21.0,1.0,21.0,21.0,21.0,ATS,NaN,01
2,1,M,M015,P.S. 015 Roberto Clemente,01,GEN ED,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01
3,1,M,M015,P.S. 015 Roberto Clemente,01,CTT,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01
4,1,M,M015,P.S. 015 Roberto Clemente,02,GEN ED,-,-,-,15.0,1.0,15.0,15.0,15.0,ATS,NaN,01

In [329]:
data["class_size"].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27611 entries, 0 to 27610
Data columns (total 17 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   CSD                                   27611 non-null  int64
 1   BOROUGH                               27611 non-null  object
 2   SCHOOL CODE                           27611 non-null  object
 3   SCHOOL NAME                           27611 non-null  object
 4   GRADE                                 26127 non-null  object
 5   PROGRAM TYPE                          26127 non-null  object
 6   CORE SUBJECT (MS CORE and 9-12 ONLY)  26127 non-null  object
 7   CORE COURSE (MS CORE and 9-12 ONLY)   26127 non-null  object
 8   SERVICE CATEGORY(K-9* ONLY)           26127 non-null  object
 9   NUMBER OF STUDENTS / SEATS FILLED     26127 non-null  float64
 10  NUMBER OF SECTIONS                    26127 non-null  float64
 11  AVERAGE CLASS SIZE                    26127 non-null  float64
 12  SIZE OF SMALLEST CLASS                26127 non-null  float64
 13  SIZE OF LARGEST CLASS                 26127 non-null  float64
 14  DATA SOURCE                           26127 non-null  object
 15  SCHOOLWIDE PUPIL-TEACHER RATIO        1484 non-null   float64
 16  padded_csd                            27611 non-null  object
dtypes: float64(6), int64(1), object(10)
memory usage: 3.6+ MB

In [330]:
data["class_size"]["DBN"] = data["class_size"]["padded_csd"] + data["class_size"]["SCHOOL CODE"]

In [331]:
data["class_size"].head()

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN
0,1,M,M015,P.S. 015 Roberto Clemente,0K,GEN ED,-,-,-,19.0,1.0,19.0,19.0,19.0,ATS,NaN,01,01M015
1,1,M,M015,P.S. 015 Roberto Clemente,0K,CTT,-,-,-,21.0,1.0,21.0,21.0,21.0,ATS,NaN,01,01M015
2,1,M,M015,P.S. 015 Roberto Clemente,01,GEN ED,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
3,1,M,M015,P.S. 015 Roberto Clemente,01,CTT,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
4,1,M,M015,P.S. 015 Roberto Clemente,02,GEN ED,-,-,-,15.0,1.0,15.0,15.0,15.0,ATS,NaN,01,01M015

## Combining SAT Scores

In the following, I will create a variable summing up the SAT scores in the three different sections of the exam in order to facilitate correlating scores with demographic factors.

In [332]:
target_cols = ['SAT Math Avg. Score', 'SAT Critical Reading Avg. Score', 'SAT Writing Avg. Score']
for col in target_cols:
    data['sat_results'].loc[:,col] = pd.to_numeric(data['sat_results'].loc[:,col],errors='coerce')
data['sat_results'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 6 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   DBN                              478 non-null    object
 1   SCHOOL NAME                      478 non-null    object
 2   Num of SAT Test Takers           478 non-null    object
 3   SAT Critical Reading Avg. Score  421 non-null    float64
 4   SAT Math Avg. Score              421 non-null    float64
 5   SAT Writing Avg. Score           421 non-null    float64
dtypes: float64(3), object(3)
memory usage: 22.5+ KB

In [333]:
data['sat_results']['sat_score'] = data['sat_results'][target_cols[0]] + data['sat_results'][target_cols[1]] + data['sat_results'][target_cols[2]]

In [334]:
data['sat_results'].head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,sat_score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355.0,404.0,363.0,1122.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383.0,423.0,366.0,1172.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377.0,402.0,370.0,1149.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414.0,401.0,359.0,1174.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390.0,433.0,384.0,1207.0

## Parsing Geographic Coordinates for Schools

Parsing latitude and longitude for each school is going to be the next step in line.  The coordinates are currently in the text field 'Location 1' in the 'hs_directory' data set.

In [335]:
data['hs_directory']['Location 1'].head()

0    8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...
1    2630 Benson Avenue\nBrooklyn, NY 11214\n(40.59...
2    1014 Lafayette Avenue\nBrooklyn, NY 11221\n(40...
3    1980 Lafayette Avenue\nBronx, NY 10473\n(40.82...
4    100 Amsterdam Avenue\nNew York, NY 10023\n(40....
Name: Location 1, dtype: object

I will extract the coordinates using a regex pattern.

In [336]:
import re

# define function to find pattern in string
def find_coordinates(str):
    pattern = r'\(.+\)'
    coordinates = re.findall(pattern, str)
    # strip expected pattern of junk chars, split them up and strip them
    latitude = coordinates[0].split(",")[0].replace("(", "")
    return latitude

data['hs_directory']['lat'] = data['hs_directory']['Location 1'].apply(find_coordinates)
data['hs_directory'].head()

,dbn,school_name,borough,building_code,phone_number,fax_number,grade_span_min,grade_span_max,expgrade_span_min,expgrade_span_max,...,priority10,Location 1,Community Board,Council District,Census Tract,BIN,BBL,NTA,DBN,lat
0,27Q260,Frederick Douglass Academy VI High School,Queens,Q465,718-471-2154,718-471-2890,9.0,12,NaN,NaN,...,NaN,"8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...",14.0,31.0,100802.0,4300730.0,4.157360e+09,Far Rockaway-Bayswater ...,27Q260,40.601989336
1,21K559,Life Academy High School for Film and Music,Brooklyn,K400,718-333-7750,718-333-7775,9.0,12,NaN,NaN,...,NaN,"2630 Benson Avenue\nBrooklyn, NY 11214\n(40.59...",13.0,47.0,306.0,3186454.0,3.068830e+09,Gravesend ...,21K559,40.593593811
2,16K393,Frederick Douglass Academy IV Secondary School,Brooklyn,K026,718-574-2820,718-574-2821,9.0,12,NaN,NaN,...,NaN,"1014 Lafayette Avenue\nBrooklyn, NY 11221\n(40...",3.0,36.0,291.0,3393805.0,3.016160e+09,Stuyvesant Heights ...,16K393,40.692133704
3,08X305,Pablo Neruda Academy,Bronx,X450,718-824-1682,718-824-1663,9.0,12,NaN,NaN,...,NaN,"1980 Lafayette Avenue\nBronx, NY 10473\n(40.82...",9.0,18.0,16.0,2022205.0,2.036040e+09,Soundview-Castle Hill-Clason Point-Harding Par...,08X305,40.822303765
4,03M485,Fiorello H. LaGuardia High School of Music & A...,Manhattan,M485,212-496-0700,212-724-5748,9.0,12,NaN,NaN,...,NaN,"100 Amsterdam Avenue\nNew York, NY 10023\n(40....",7.0,6.0,151.0,1030341.0,1.011560e+09,Lincoln Square ...,03M485,40.773670507

In [337]:
# define function to find pattern in string
def find_coordinates(str):
    pattern = r'\(.+\)'
    coordinates = re.findall(pattern, str)
    # strip expected pattern of junk chars, split them up and strip them
    latitude = coordinates[0].split(",")[1].replace(")", "")
    return latitude

data['hs_directory']['lon'] = data['hs_directory']['Location 1'].apply(find_coordinates)
data['hs_directory'].head()

,dbn,school_name,borough,building_code,phone_number,fax_number,grade_span_min,grade_span_max,expgrade_span_min,expgrade_span_max,...,Location 1,Community Board,Council District,Census Tract,BIN,BBL,NTA,DBN,lat,lon
0,27Q260,Frederick Douglass Academy VI High School,Queens,Q465,718-471-2154,718-471-2890,9.0,12,NaN,NaN,...,"8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...",14.0,31.0,100802.0,4300730.0,4.157360e+09,Far Rockaway-Bayswater ...,27Q260,40.601989336,-73.762834323
1,21K559,Life Academy High School for Film and Music,Brooklyn,K400,718-333-7750,718-333-7775,9.0,12,NaN,NaN,...,"2630 Benson Avenue\nBrooklyn, NY 11214\n(40.59...",13.0,47.0,306.0,3186454.0,3.068830e+09,Gravesend ...,21K559,40.593593811,-73.984729232
2,16K393,Frederick Douglass Academy IV Secondary School,Brooklyn,K026,718-574-2820,718-574-2821,9.0,12,NaN,NaN,...,"1014 Lafayette Avenue\nBrooklyn, NY 11221\n(40...",3.0,36.0,291.0,3393805.0,3.016160e+09,Stuyvesant Heights ...,16K393,40.692133704,-73.931503172
3,08X305,Pablo Neruda Academy,Bronx,X450,718-824-1682,718-824-1663,9.0,12,NaN,NaN,...,"1980 Lafayette Avenue\nBronx, NY 10473\n(40.82...",9.0,18.0,16.0,2022205.0,2.036040e+09,Soundview-Castle Hill-Clason Point-Harding Par...,08X305,40.822303765,-73.85596139
4,03M485,Fiorello H. LaGuardia High School of Music & A...,Manhattan,M485,212-496-0700,212-724-5748,9.0,12,NaN,NaN,...,"100 Amsterdam Avenue\nNew York, NY 10023\n(40....",7.0,6.0,151.0,1030341.0,1.011560e+09,Lincoln Square ...,03M485,40.773670507,-73.985268558

In [338]:
data['hs_directory']['lat'] = pd.to_numeric(data['hs_directory']['lat'], errors='coerce')
data['hs_directory']['lon'] = pd.to_numeric(data['hs_directory']['lon'], errors='coerce')
data['hs_directory'].head()

,dbn,school_name,borough,building_code,phone_number,fax_number,grade_span_min,grade_span_max,expgrade_span_min,expgrade_span_max,...,Location 1,Community Board,Council District,Census Tract,BIN,BBL,NTA,DBN,lat,lon
0,27Q260,Frederick Douglass Academy VI High School,Queens,Q465,718-471-2154,718-471-2890,9.0,12,NaN,NaN,...,"8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...",14.0,31.0,100802.0,4300730.0,4.157360e+09,Far Rockaway-Bayswater ...,27Q260,40.601989,-73.762834
1,21K559,Life Academy High School for Film and Music,Brooklyn,K400,718-333-7750,718-333-7775,9.0,12,NaN,NaN,...,"2630 Benson Avenue\nBrooklyn, NY 11214\n(40.59...",13.0,47.0,306.0,3186454.0,3.068830e+09,Gravesend ...,21K559,40.593594,-73.984729
2,16K393,Frederick Douglass Academy IV Secondary School,Brooklyn,K026,718-574-2820,718-574-2821,9.0,12,NaN,NaN,...,"1014 Lafayette Avenue\nBrooklyn, NY 11221\n(40...",3.0,36.0,291.0,3393805.0,3.016160e+09,Stuyvesant Heights ...,16K393,40.692134,-73.931503
3,08X305,Pablo Neruda Academy,Bronx,X450,718-824-1682,718-824-1663,9.0,12,NaN,NaN,...,"1980 Lafayette Avenue\nBronx, NY 10473\n(40.82...",9.0,18.0,16.0,2022205.0,2.036040e+09,Soundview-Castle Hill-Clason Point-Harding Par...,08X305,40.822304,-73.855961
4,03M485,Fiorello H. LaGuardia High School of Music & A...,Manhattan,M485,212-496-0700,212-724-5748,9.0,12,NaN,NaN,...,"100 Amsterdam Avenue\nNew York, NY 10023\n(40....",7.0,6.0,151.0,1030341.0,1.011560e+09,Lincoln Square ...,03M485,40.773671,-73.985269

In [339]:
data['hs_directory'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 435 entries, 0 to 434
Data columns (total 67 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   dbn                               435 non-null    object
 1   school_name                       435 non-null    object
 2   borough                           435 non-null    object
 3   building_code                     435 non-null    object
 4   phone_number                      435 non-null    object
 5   fax_number                        423 non-null    object
 6   grade_span_min                    432 non-null    float64
 7   grade_span_max                    435 non-null    int64
 8   expgrade_span_min                 31 non-null     float64
 9   expgrade_span_max                 33 non-null     float64
 10  bus                               434 non-null    object
 11  subway                            358 non-null    object
 12  primary_address_line_1            435 non-null    object
 13  city                              435 non-null    object
 14  state_code                        435 non-null    object
 15  postcode                          435 non-null    int64
 16  website                           430 non-null    object
 17  total_students                    426 non-null    float64
 18  campus_name                       217 non-null    object
 19  school_type                       104 non-null    object
 20  overview_paragraph                434 non-null    object
 21  program_highlights                434 non-null    object
 22  language_classes                  412 non-null    object
 23  advancedplacement_courses         340 non-null    object
 24  online_ap_courses                 64 non-null     object
 25  online_language_courses           73 non-null     object
 26  extracurricular_activities        435 non-null    object
 27  psal_sports_boys                  373 non-null    object
 28  psal_sports_girls                 373 non-null    object
 29  psal_sports_coed                  147 non-null    object
 30  school_sports                     297 non-null    object
 31  partner_cbo                       354 non-null    object
 32  partner_hospital                  196 non-null    object
 33  partner_highered                  378 non-null    object
 34  partner_cultural                  305 non-null    object
 35  partner_nonprofit                 297 non-null    object
 36  partner_corporate                 198 non-null    object
 37  partner_financial                 72 non-null     object
 38  partner_other                     188 non-null    object
 39  addtl_info1                       354 non-null    object
 40  addtl_info2                       229 non-null    object
 41  start_time                        431 non-null    object
 42  end_time                          431 non-null    object
 43  se_services                       435 non-null    object
 44  ell_programs                      435 non-null    object
 45  school_accessibility_description  435 non-null    object
 46  number_programs                   435 non-null    int64
 47  priority01                        435 non-null    object
 48  priority02                        352 non-null    object
 49  priority03                        243 non-null    object
 50  priority04                        177 non-null    object
 51  priority05                        39 non-null     object
 52  priority06                        17 non-null     object
 53  priority07                        4 non-null      object
 54  priority08                        1 non-null      object
 55  priority09                        1 non-null      object
 56  priority10                        1 non-null      object
 57  Location 1                        435 non-null    object
 58  Community Board                   432 non-null    float64
 59  Council District                  432 non-null    float64
 60  Census Tract                      432 non-null    float64
 61  BIN                               431 non-null    float64
 62  BBL                               431 non-null    float64
 63  NTA                               432 non-null    object
 64  DBN                               435 non-null    object
 65  lat                               435 non-null    float64
 66  lon                               435 non-null    float64
dtypes: float64(11), int64(3), object(53)
memory usage: 227.8+ KB

# Condensing Data

## Condensing the Class Size Dataset
I plan to join the datasets on the DBN col. Therefore it is critical that those values are unique in all of the datasets. While that is already the case in most of our datasets, the class_size dataset appears to contain some duplicates here.

In [340]:
data["class_size"].head(10)

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN
0,1,M,M015,P.S. 015 Roberto Clemente,0K,GEN ED,-,-,-,19.0,1.0,19.0,19.0,19.0,ATS,NaN,01,01M015
1,1,M,M015,P.S. 015 Roberto Clemente,0K,CTT,-,-,-,21.0,1.0,21.0,21.0,21.0,ATS,NaN,01,01M015
2,1,M,M015,P.S. 015 Roberto Clemente,01,GEN ED,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
3,1,M,M015,P.S. 015 Roberto Clemente,01,CTT,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
4,1,M,M015,P.S. 015 Roberto Clemente,02,GEN ED,-,-,-,15.0,1.0,15.0,15.0,15.0,ATS,NaN,01,01M015
5,1,M,M015,P.S. 015 Roberto Clemente,02,CTT,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
6,1,M,M015,P.S. 015 Roberto Clemente,03,GEN ED,-,-,-,12.0,1.0,12.0,12.0,12.0,ATS,NaN,01,01M015
7,1,M,M015,P.S. 015 Roberto Clemente,03,CTT,-,-,-,15.0,1.0,15.0,15.0,15.0,ATS,NaN,01,01M015
8,1,M,M015,P.S. 015 Roberto Clemente,04,GEN ED,-,-,-,26.0,2.0,13.0,12.0,14.0,ATS,NaN,01,01M015
9,1,M,M015,P.S. 015 Roberto Clemente,05,GEN ED,-,-,-,27.0,1.0,27.0,27.0,27.0,ATS,NaN,01,01M015

Each schools data seems to be disaggregated by grade, program and courses. Since these are not parameters I need for my analysis I will drop most of them, especially rows where the grade is not between 9 and 12 (since this is an analysis of high school data).

In [341]:
# create variable to facilitate code
class_size = data["class_size"]

# investigate values in GRADE col
class_size["GRADE "].unique()

array(['0K', '01', '02', '03', '04', '05', '0K-09', nan, '06', '07', '08',
       'MS Core', '09-12', '09'], dtype=object)

In [342]:
class_size.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27611 entries, 0 to 27610
Data columns (total 18 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   CSD                                   27611 non-null  int64
 1   BOROUGH                               27611 non-null  object
 2   SCHOOL CODE                           27611 non-null  object
 3   SCHOOL NAME                           27611 non-null  object
 4   GRADE                                 26127 non-null  object
 5   PROGRAM TYPE                          26127 non-null  object
 6   CORE SUBJECT (MS CORE and 9-12 ONLY)  26127 non-null  object
 7   CORE COURSE (MS CORE and 9-12 ONLY)   26127 non-null  object
 8   SERVICE CATEGORY(K-9* ONLY)           26127 non-null  object
 9   NUMBER OF STUDENTS / SEATS FILLED     26127 non-null  float64
 10  NUMBER OF SECTIONS                    26127 non-null  float64
 11  AVERAGE CLASS SIZE                    26127 non-null  float64
 12  SIZE OF SMALLEST CLASS                26127 non-null  float64
 13  SIZE OF LARGEST CLASS                 26127 non-null  float64
 14  DATA SOURCE                           26127 non-null  object
 15  SCHOOLWIDE PUPIL-TEACHER RATIO        1484 non-null   float64
 16  padded_csd                            27611 non-null  object
 17  DBN                                   27611 non-null  object
dtypes: float64(6), int64(1), object(11)
memory usage: 3.8+ MB

In [343]:
# drop non high school classes
drop_rows = class_size.index[class_size["GRADE "] != "09-12"]
drop_rows

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            27547, 27548, 27549, 27550, 27551, 27552, 27553, 27570, 27594,
            27610],
           dtype='int64', length=16967)

In [344]:
class_size.drop(drop_rows, inplace=True)

In [345]:
drop_rows_pr = class_size.index[class_size["PROGRAM TYPE"] != "GEN ED"]
drop_rows_pr

Int64Index([  240,   241,   242,   243,   244,   245,   246,   247,   248,
              249,
            ...
            27539, 27586, 27587, 27588, 27589, 27590, 27591, 27592, 27593,
            27609],
           dtype='int64', length=4131)

In [346]:
class_size.drop(drop_rows_pr, inplace=True)
class_size

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN
225,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 9,-,63.0,3.0,21.0,19.0,25.0,STARS,NaN,01,01M292
226,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 10,-,79.0,3.0,26.3,24.0,31.0,STARS,NaN,01,01M292
227,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 11,-,38.0,2.0,19.0,16.0,22.0,STARS,NaN,01,01M292
228,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 12,-,69.0,3.0,23.0,13.0,30.0,STARS,NaN,01,01M292
229,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,MATH,Integrated Algebra,-,53.0,3.0,17.7,16.0,21.0,STARS,NaN,01,01M292
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27604,32,K,K564,Bushwick Community High School,09-12,GEN ED,SCIENCE,Physics,-,49.0,2.0,24.5,22.0,27.0,STARS,NaN,32,32K564
27605,32,K,K564,Bushwick Community High School,09-12,GEN ED,SOCIAL STUDIES,Global History & Geography,-,237.0,10.0,23.7,15.0,31.0,STARS,NaN,32,32K564
27606,32,K,K564,Bushwick Community High School,09-12,GEN ED,SOCIAL STUDIES,US History & Government,-,256.0,10.0,25.6,15.0,35.0,STARS,NaN,32,32K564
27607,32,K,K564,Bushwick Community High School,09-12,GEN ED,SOCIAL STUDIES,Economics,-,65.0,2.0,32.5,32.0,33.0,STARS,NaN,32,32K564
27608,32,K,K564,Bushwick Community High School,09-12,GEN ED,SOCIAL STUDIES,Participation in Government,-,53.0,2.0,26.5,25.0,28.0,STARS,NaN,32,32K564

After dropping columns we do not need, there are still multiple entries for each school in the dataset, since they are still disaggregated by class. I will compute the average class size across all courses for each school to work with.

In [347]:
avg_class_size = class_size.groupby('DBN')["AVERAGE CLASS SIZE"].agg('mean')
avg_class_size = pd.DataFrame(avg_class_size)
avg_class_size

        AVERAGE CLASS SIZE
DBN
01M292           22.564286
01M332           22.000000
01M378           33.000000
01M448           22.231250
01M450           21.200000
...                    ...
32K549           22.760000
32K552           23.900000
32K554           17.793750
32K556           25.060000
32K564           24.964286

[583 rows x 1 columns]

In [348]:
avg_class_size.reset_index(inplace=True)
avg_class_size.rename(columns={"AVERAGE CLASS SIZE": "avg_class_size"}, inplace=True)
avg_class_size

        DBN  avg_class_size
0    01M292       22.564286
1    01M332       22.000000
2    01M378       33.000000
3    01M448       22.231250
4    01M450       21.200000
..      ...             ...
578  32K549       22.760000
579  32K552       23.900000
580  32K554       17.793750
581  32K556       25.060000
582  32K564       24.964286

[583 rows x 2 columns]

In [349]:
class_size_comp = pd.merge(class_size, avg_class_size, on="DBN")
class_size_comp

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN,avg_class_size
0,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 9,-,63.0,3.0,21.0,19.0,25.0,STARS,NaN,01,01M292,22.564286
1,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 10,-,79.0,3.0,26.3,24.0,31.0,STARS,NaN,01,01M292,22.564286
2,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 11,-,38.0,2.0,19.0,16.0,22.0,STARS,NaN,01,01M292,22.564286
3,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 12,-,69.0,3.0,23.0,13.0,30.0,STARS,NaN,01,01M292,22.564286
4,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,MATH,Integrated Algebra,-,53.0,3.0,17.7,16.0,21.0,STARS,NaN,01,01M292,22.564286
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6508,32,K,K564,Bushwick Community High School,09-12,GEN ED,SCIENCE,Physics,-,49.0,2.0,24.5,22.0,27.0,STARS,NaN,32,32K564,24.964286
6509,32,K,K564,Bushwick Community High School,09-12,GEN ED,SOCIAL STUDIES,Global History & Geography,-,237.0,10.0,23.7,15.0,31.0,STARS,NaN,32,32K564,24.964286
6510,32,K,K564,Bushwick Community High School,09-12,GEN ED,SOCIAL STUDIES,US History & Government,-,256.0,10.0,25.6,15.0,35.0,STARS,NaN,32,32K564,24.964286
6511,32,K,K564,Bushwick Community High School,09-12,GEN ED,SOCIAL STUDIES,Economics,-,65.0,2.0,32.5,32.0,33.0,STARS,NaN,32,32K564,24.964286
6512,32,K,K564,Bushwick Community High School,09-12,GEN ED,SOCIAL STUDIES,Participation in Government,-,53.0,2.0,26.5,25.0,28.0,STARS,NaN,32,32K564,24.964286

I computed the dataframe this way to avoid loss of too much information. Though for further analyses I probably do not need all these duplicates so I will drop them and reassign the result to the dictionary.

In [350]:
class_size_comp.drop_duplicates(subset='DBN', inplace=True, keep='first')
class_size_comp

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN,avg_class_size
0,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 9,-,63.0,3.0,21.0,19.0,25.0,STARS,NaN,01,01M292,22.564286
14,1,M,M332,University Neighborhood Middle School,09-12,GEN ED,ENGLISH,MS English Core,-,20.0,1.0,20.0,20.0,20.0,STARS,NaN,01,01M332,22.000000
16,1,M,M378,School for Global Leaders,09-12,GEN ED,MATH,Integrated Algebra,-,33.0,1.0,33.0,33.0,33.0,STARS,NaN,01,01M378,33.000000
17,1,M,M448,University Neighborhood High School,09-12,GEN ED,ENGLISH,English 9,-,53.0,3.0,17.7,13.0,27.0,STARS,NaN,01,01M448,22.231250
33,1,M,M450,East Side Community School,09-12,GEN ED,ENGLISH,English 9,-,51.0,2.0,25.5,23.0,28.0,STARS,NaN,01,01M450,21.200000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6437,32,K,K552,Academy of Urban Planning,09-12,GEN ED,ENGLISH,English 10,-,74.0,4.0,18.5,13.0,21.0,STARS,NaN,32,32K552,23.900000
6453,32,K,K549,Bushwick School for Social Justice,09-12,GEN ED,ENGLISH,English 9,-,60.0,3.0,20.0,17.0,22.0,STARS,NaN,32,32K549,22.760000
6468,32,K,K554,All City Leadership Secondary School,09-12,GEN ED,ENGLISH,English 9,-,34.0,3.0,11.3,11.0,12.0,STARS,NaN,32,32K554,17.793750
6484,32,K,K556,Bushwick Leaders High School for Academic Exce...,09-12,GEN ED,ENGLISH,English 9,-,144.0,7.0,20.6,12.0,26.0,STARS,NaN,32,32K556,25.060000
6499,32,K,K564,Bushwick Community High School,09-12,GEN ED,ENGLISH,English 9,-,261.0,10.0,26.1,17.0,35.0,STARS,NaN,32,32K564,24.964286

In [351]:
class_size_tot_avg = class_size.groupby('DBN').agg('mean')
class_size_tot_avg.reset_index(inplace=True)
class_size_tot_avg

,DBN,CSD,NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,SCHOOLWIDE PUPIL-TEACHER RATIO
0,01M292,1,88.000000,4.000000,22.564286,18.500000,26.571429,NaN
1,01M332,1,46.000000,2.000000,22.000000,21.000000,23.500000,NaN
2,01M378,1,33.000000,1.000000,33.000000,33.000000,33.000000,NaN
3,01M448,1,105.687500,4.750000,22.231250,18.250000,27.062500,NaN
4,01M450,1,57.600000,2.733333,21.200000,19.400000,22.866667,NaN
...,...,...,...,...,...,...,...,...
578,32K549,32,71.066667,3.266667,22.760000,19.866667,25.866667,NaN
579,32K552,32,102.375000,4.312500,23.900000,19.937500,28.000000,NaN
580,32K554,32,66.937500,3.812500,17.793750,14.750000,21.625000,NaN
581,32K556,32,132.333333,5.400000,25.060000,18.333333,30.000000,NaN
582,32K564,32,136.142857,5.428571,24.964286,20.071429,28.571429,NaN

In [352]:
data['class_size'] = class_size_tot_avg
data['class_size']

,DBN,CSD,NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,SCHOOLWIDE PUPIL-TEACHER RATIO
0,01M292,1,88.000000,4.000000,22.564286,18.500000,26.571429,NaN
1,01M332,1,46.000000,2.000000,22.000000,21.000000,23.500000,NaN
2,01M378,1,33.000000,1.000000,33.000000,33.000000,33.000000,NaN
3,01M448,1,105.687500,4.750000,22.231250,18.250000,27.062500,NaN
4,01M450,1,57.600000,2.733333,21.200000,19.400000,22.866667,NaN
...,...,...,...,...,...,...,...,...
578,32K549,32,71.066667,3.266667,22.760000,19.866667,25.866667,NaN
579,32K552,32,102.375000,4.312500,23.900000,19.937500,28.000000,NaN
580,32K554,32,66.937500,3.812500,17.793750,14.750000,21.625000,NaN
581,32K556,32,132.333333,5.400000,25.060000,18.333333,30.000000,NaN
582,32K564,32,136.142857,5.428571,24.964286,20.071429,28.571429,NaN

Next in line to condense the data is the demographics dataset.

In [353]:
demographics = data['demographics']
demographics

,DBN,Name,schoolyear,fl_percent,frl_percent,total_enrollment,prek,k,grade1,grade2,...,black_num,black_per,hispanic_num,hispanic_per,white_num,white_per,male_num,male_per,female_num,female_per
0,01M015,P.S. 015 ROBERTO CLEMENTE,20052006,89.4,NaN,281,15,36,40,33,...,74,26.3,189,67.3,5,1.8,158.0,56.2,123.0,43.8
1,01M015,P.S. 015 ROBERTO CLEMENTE,20062007,89.4,NaN,243,15,29,39,38,...,68,28.0,153,63.0,4,1.6,140.0,57.6,103.0,42.4
2,01M015,P.S. 015 ROBERTO CLEMENTE,20072008,89.4,NaN,261,18,43,39,36,...,77,29.5,157,60.2,7,2.7,143.0,54.8,118.0,45.2
3,01M015,P.S. 015 ROBERTO CLEMENTE,20082009,89.4,NaN,252,17,37,44,32,...,75,29.8,149,59.1,7,2.8,149.0,59.1,103.0,40.9
4,01M015,P.S. 015 ROBERTO CLEMENTE,20092010,,96.5,208,16,40,28,32,...,67,32.2,118,56.7,6,2.9,124.0,59.6,84.0,40.4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10070,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,20072008,85.6,NaN,355,NaN,NaN,NaN,NaN,...,151,42.5,198,55.8,5,1.4,181.0,51.0,174.0,49.0
10071,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,20082009,65.2,NaN,383,NaN,NaN,NaN,NaN,...,132,34.5,245,64.0,2,0.5,206.0,53.8,177.0,46.2
10072,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,20092010,,89.2,395,NaN,NaN,NaN,NaN,...,146,37.0,242,61.3,3,0.8,199.0,50.4,196.0,49.6
10073,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,20102011,,88.2,420,NaN,NaN,NaN,NaN,...,166,39.5,242,57.6,8,1.9,209.0,49.8,211.0,50.2
10074,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,20112012,NaN,81.8,382,,,,,...,137,35.9,235,61.5,7,1.8,169.0,44.2,213.0,55.8

In this dataset, the column preventin the 'DBN' from being unique is the schoolyear, I will only keep the most recent data.

In [354]:
# finding most recent year
demographics.schoolyear.max()

20112012

In [355]:
demographics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10075 entries, 0 to 10074
Data columns (total 38 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   DBN                10075 non-null  object
 1   Name               10075 non-null  object
 2   schoolyear         10075 non-null  int64
 3   fl_percent         8560 non-null   object
 4   frl_percent        4482 non-null   float64
 5   total_enrollment   10075 non-null  int64
 6   prek               4712 non-null   object
 7   k                  5882 non-null   object
 8   grade1             5881 non-null   object
 9   grade2             5851 non-null   object
 10  grade3             5779 non-null   object
 11  grade4             5741 non-null   object
 12  grade5             5777 non-null   object
 13  grade6             4517 non-null   object
 14  grade7             4203 non-null   object
 15  grade8             4085 non-null   object
 16  grade9             3974 non-null   object
 17  grade10            3846 non-null   object
 18  grade11            3674 non-null   object
 19  grade12            3513 non-null   object
 20  ell_num            9885 non-null   float64
 21  ell_percent        9963 non-null   float64
 22  sped_num           9985 non-null   float64
 23  sped_percent       10075 non-null  float64
 24  ctt_num            8678 non-null   object
 25  selfcontained_num  9075 non-null   object
 26  asian_num          10075 non-null  int64
 27  asian_per          10075 non-null  float64
 28  black_num          10075 non-null  int64
 29  black_per          10075 non-null  float64
 30  hispanic_num       10075 non-null  int64
 31  hispanic_per       10075 non-null  float64
 32  white_num          10075 non-null  int64
 33  white_per          10075 non-null  float64
 34  male_num           10034 non-null  float64
 35  male_per           10075 non-null  float64
 36  female_num         10051 non-null  float64
 37  female_per         10075 non-null  float64
dtypes: float64(13), int64(6), object(19)
memory usage: 2.9+ MB

In [356]:
# filtering demographics
data['demographics'] = demographics.loc[demographics.schoolyear == 20112012]
data['demographics']

,DBN,Name,schoolyear,fl_percent,frl_percent,total_enrollment,prek,k,grade1,grade2,...,black_num,black_per,hispanic_num,hispanic_per,white_num,white_per,male_num,male_per,female_num,female_per
6,01M015,P.S. 015 ROBERTO CLEMENTE,20112012,NaN,89.4,189,13,31,35,28,...,63,33.3,109,57.7,4,2.1,97.0,51.3,92.0,48.7
13,01M019,P.S. 019 ASHER LEVY,20112012,NaN,61.5,328,32,46,52,54,...,81,24.7,158,48.2,28,8.5,147.0,44.8,181.0,55.2
20,01M020,PS 020 ANNA SILVER,20112012,NaN,92.5,626,52,102,121,87,...,55,8.8,357,57.0,16,2.6,330.0,52.7,296.0,47.3
27,01M034,PS 034 FRANKLIN D ROOSEVELT,20112012,NaN,99.7,401,14,34,38,36,...,90,22.4,275,68.6,8,2.0,204.0,50.9,197.0,49.1
35,01M063,PS 063 WILLIAM MCKINLEY,20112012,NaN,78.9,176,18,20,30,21,...,41,23.3,110,62.5,15,8.5,97.0,55.1,79.0,44.9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10046,32K549,BUSHWICK SCHOOL FOR SOCIAL JUSTICE,20112012,NaN,75.1,434,,,,,...,123,28.3,298,68.7,8,1.8,210.0,48.4,224.0,51.6
10053,32K552,ACADEMY OF URBAN PLANNING,20112012,NaN,77.1,398,,,,,...,105,26.4,280,70.4,4,1.0,217.0,54.5,181.0,45.5
10060,32K554,ALL CITY LEADERSHIP SECONDARY SCHOOL,20112012,NaN,81.4,263,,,,,...,34,12.9,209,79.5,4,1.5,137.0,52.1,126.0,47.9
10067,32K556,BUSHWICK LEADERS HIGH SCHOOL FOR ACADEMIC EXCELL,20112012,NaN,88.0,462,,,,,...,98,21.2,357,77.3,0,0.0,246.0,53.2,216.0,46.8
10074,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,20112012,NaN,81.8,382,,,,,...,137,35.9,235,61.5,7,1.8,169.0,44.2,213.0,55.8

Last but not least, I will condense the graduation data set.

In [357]:
graduation = data['graduation']
graduation

,Demographic,DBN,School Name,Cohort,Total Cohort,Total Grads - n,Total Grads - % of cohort,Total Regents - n,Total Regents - % of cohort,Total Regents - % of grads,...,Regents w/o Advanced - n,Regents w/o Advanced - % of cohort,Regents w/o Advanced - % of grads,Local - n,Local - % of cohort,Local - % of grads,Still Enrolled - n,Still Enrolled - % of cohort,Dropped Out - n,Dropped Out - % of cohort
0,Total Cohort,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL,2003,5,s,NaN,s,NaN,NaN,...,s,NaN,NaN,s,NaN,NaN,s,NaN,s,NaN
1,Total Cohort,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL,2004,55,37,67.3,17,30.9,45.9,...,17,30.9,45.9,20,36.4,54.1,15,27.3,3,5.5
2,Total Cohort,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL,2005,64,43,67.2,27,42.2,62.8,...,27,42.2,62.8,16,25.0,37.2,9,14.1,9,14.1
3,Total Cohort,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL,2006,78,43,55.1,36,46.2,83.7,...,36,46.2,83.7,7,9.0,16.3,16,20.5,11,14.1
4,Total Cohort,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL,2006 Aug,78,44,56.4,37,47.4,84.1,...,37,47.4,84.1,7,9.0,15.9,15,19.2,11,14.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25091,Male,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,2003,65,1,1.5,0,0.0,0.0,...,0,0.0,0.0,1,1.5,100.0,44.0,67.7,20.0,30.8
25092,Male,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,2004,64,2,3.1,0,0.0,0.0,...,0,0.0,0.0,2,3.1,100.0,38.0,59.4,22.0,34.4
25093,Male,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,2005,79,3,3.8,1,1.3,33.3,...,1,1.3,33.3,2,2.5,66.7,46.0,58.2,28.0,35.4
25094,Male,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,2006,57,4,7.0,2,3.5,50.0,...,2,3.5,50.0,2,3.5,50.0,34.0,59.6,17.0,29.8
25095,Male,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,2006 Aug,57,4,7.0,2,3.5,50.0,...,2,3.5,50.0,2,3.5,50.0,34.0,59.6,17.0,29.8

In [358]:
graduation.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25096 entries, 0 to 25095
Data columns (total 23 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Demographic                         25096 non-null  object
 1   DBN                                 25096 non-null  object
 2   School Name                         25096 non-null  object
 3   Cohort                              25096 non-null  object
 4   Total Cohort                        25096 non-null  int64
 5   Total Grads - n                     25096 non-null  object
 6   Total Grads - % of cohort           16704 non-null  float64
 7   Total Regents - n                   25096 non-null  object
 8   Total Regents - % of cohort         16704 non-null  float64
 9   Total Regents - % of grads          16652 non-null  float64
 10  Advanced Regents - n                25096 non-null  object
 11  Advanced Regents - % of cohort      16704 non-null  float64
 12  Advanced Regents - % of grads       16652 non-null  float64
 13  Regents w/o Advanced - n            25096 non-null  object
 14  Regents w/o Advanced - % of cohort  16704 non-null  float64
 15  Regents w/o Advanced - % of grads   16652 non-null  float64
 16  Local - n                           25096 non-null  object
 17  Local - % of cohort                 16704 non-null  float64
 18  Local - % of grads                  16652 non-null  float64
 19  Still Enrolled - n                  25096 non-null  object
 20  Still Enrolled - % of cohort        16704 non-null  float64
 21  Dropped Out - n                     25096 non-null  object
 22  Dropped Out - % of cohort           16704 non-null  float64
dtypes: float64(11), int64(1), object(11)
memory usage: 4.4+ MB

Demographic and Cohort are causing duplicates in DBN. I will keep only the most recent cohort and only rows where demographics is 'Total Cohort'.

In [359]:
# filter demographics by Cohort
graduation.Cohort.unique()

array(['2003', '2004', '2005', '2006', '2006 Aug', '2001', '2002'],
      dtype=object)

In [360]:
graduation = graduation.loc[graduation.Cohort == '2006']

In [361]:
graduation

,Demographic,DBN,School Name,Cohort,Total Cohort,Total Grads - n,Total Grads - % of cohort,Total Regents - n,Total Regents - % of cohort,Total Regents - % of grads,...,Regents w/o Advanced - n,Regents w/o Advanced - % of cohort,Regents w/o Advanced - % of grads,Local - n,Local - % of cohort,Local - % of grads,Still Enrolled - n,Still Enrolled - % of cohort,Dropped Out - n,Dropped Out - % of cohort
3,Total Cohort,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL,2006,78,43,55.1,36,46.2,83.7,...,36,46.2,83.7,7,9.0,16.3,16,20.5,11,14.1
10,Total Cohort,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,2006,124,53,42.7,42,33.9,79.2,...,34,27.4,64.2,11,8.9,20.8,46,37.1,20,16.1
17,Total Cohort,01M450,EAST SIDE COMMUNITY SCHOOL,2006,90,70,77.8,67,74.4,95.7,...,67,74.4,95.7,3,3.3,4.3,15,16.7,5,5.6
24,Total Cohort,01M509,MARTA VALLE HIGH SCHOOL,2006,84,47,56.0,40,47.6,85.1,...,23,27.4,48.9,7,8.3,14.9,25,29.8,5,6.0
31,Total Cohort,01M515,LOWER EAST SIDE PREPARATORY HIGH SCHO,2006,193,105,54.4,91,47.2,86.7,...,22,11.4,21.0,14,7.3,13.3,53,27.5,35,18.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25069,Male,32K549,BUSHWICK SCHOOL FOR SOCIAL JUSTICE,2006,45,32,71.1,25,55.6,78.1,...,22,48.9,68.8,7,15.6,21.9,8.0,17.8,5.0,11.1
25075,Male,32K552,ACADEMY OF URBAN PLANNING,2006,50,21,42.0,19,38.0,90.5,...,19,38.0,90.5,2,4.0,9.5,24.0,48.0,2.0,4.0
25081,Male,32K554,ALL CITY LEADERSHIP SECONDARY SCHOOL,2006,24,21,87.5,14,58.3,66.7,...,11,45.8,52.4,7,29.2,33.3,2.0,8.3,1.0,4.2
25087,Male,32K556,BUSHWICK LEADERS HIGH SCHOOL FOR ACAD,2006,51,25,49.0,8,15.7,32.0,...,7,13.7,28.0,17,33.3,68.0,12.0,23.5,12.0,23.5
25094,Male,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,2006,57,4,7.0,2,3.5,50.0,...,2,3.5,50.0,2,3.5,50.0,34.0,59.6,17.0,29.8

In [362]:
graduation.Demographic.unique()

array(['Total Cohort', 'Asian', 'Black', 'English Language Learners',
       'White', 'English Proficient Students',
       'Special Education Students', 'General Education Students',
       'Hispanic', 'Female', 'Male'], dtype=object)

In [363]:
graduation = graduation.loc[graduation.Demographic == 'Total Cohort']
data['graduation'] = graduation

In [364]:
data['ap_2010'].dtypes

DBN                                      object
SchoolName                               object
AP Test Takers                          float64
Total Exams Taken                       float64
Number of Exams with scores 3 4 or 5    float64
dtype: object

## Combining the Datasets

The next task at hand is to combine the datasets. I will use the DBN col to do so.

In [365]:
ap_2010.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 258 entries, 0 to 257
Data columns (total 5 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   DBN                                   258 non-null    object
 1   SchoolName                            258 non-null    object
 2   AP Test Takers                        233 non-null    float64
 3   Total Exams Taken                     233 non-null    float64
 4   Number of Exams with scores 3 4 or 5  151 non-null    float64
dtypes: float64(3), object(2)
memory usage: 10.2+ KB

In [366]:
data['graduation'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 405 entries, 3 to 2509
Data columns (total 23 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Demographic                         405 non-null    object
 1   DBN                                 405 non-null    object
 2   School Name                         405 non-null    object
 3   Cohort                              405 non-null    object
 4   Total Cohort                        405 non-null    int64
 5   Total Grads - n                     405 non-null    object
 6   Total Grads - % of cohort           378 non-null    float64
 7   Total Regents - n                   405 non-null    object
 8   Total Regents - % of cohort         378 non-null    float64
 9   Total Regents - % of grads          377 non-null    float64
 10  Advanced Regents - n                405 non-null    object
 11  Advanced Regents - % of cohort      378 non-null    float64
 12  Advanced Regents - % of grads       377 non-null    float64
 13  Regents w/o Advanced - n            405 non-null    object
 14  Regents w/o Advanced - % of cohort  378 non-null    float64
 15  Regents w/o Advanced - % of grads   377 non-null    float64
 16  Local - n                           405 non-null    object
 17  Local - % of cohort                 378 non-null    float64
 18  Local - % of grads                  377 non-null    float64
 19  Still Enrolled - n                  405 non-null    object
 20  Still Enrolled - % of cohort        378 non-null    float64
 21  Dropped Out - n                     405 non-null    object
 22  Dropped Out - % of cohort           378 non-null    float64
dtypes: float64(11), int64(1), object(11)
memory usage: 75.9+ KB

In [367]:
data['sat_results'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 7 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   DBN                              478 non-null    object
 1   SCHOOL NAME                      478 non-null    object
 2   Num of SAT Test Takers           478 non-null    object
 3   SAT Critical Reading Avg. Score  421 non-null    float64
 4   SAT Math Avg. Score              421 non-null    float64
 5   SAT Writing Avg. Score           421 non-null    float64
 6   sat_score                        421 non-null    float64
dtypes: float64(4), object(3)
memory usage: 26.3+ KB

In [368]:
combined = data['sat_results']

combined = combined.merge(data["ap_2010"], on="DBN", how="left")
combined = combined.merge(data["graduation"], on="DBN", how="left")

combined.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,sat_score,SchoolName,AP Test Takers,Total Exams Taken,...,Regents w/o Advanced - n,Regents w/o Advanced - % of cohort,Regents w/o Advanced - % of grads,Local - n,Local - % of cohort,Local - % of grads,Still Enrolled - n,Still Enrolled - % of cohort,Dropped Out - n,Dropped Out - % of cohort
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355.0,404.0,363.0,1122.0,NaN,NaN,NaN,...,36,46.2,83.7,7,9.0,16.3,16,20.5,11,14.1
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383.0,423.0,366.0,1172.0,UNIVERSITY NEIGHBORHOOD H.S.,39.0,49.0,...,34,27.4,64.2,11,8.9,20.8,46,37.1,20,16.1
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377.0,402.0,370.0,1149.0,EAST SIDE COMMUNITY HS,19.0,21.0,...,67,74.4,95.7,3,3.3,4.3,15,16.7,5,5.6
3,01M458,FORSYTH SATELLITE ACADEMY,7,414.0,401.0,359.0,1174.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,01M509,MARTA VALLE HIGH SCHOOL,44,390.0,433.0,384.0,1207.0,NaN,NaN,NaN,...,23,27.4,48.9,7,8.3,14.9,25,29.8,5,6.0

In [376]:
combined.shape

(363, 209)

The rest of the dataframes contains more valuable information and also has less missing DBN values so I will inner join them.

In [372]:
data['survey'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1702 entries, 0 to 55
Data columns (total 23 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   dbn         1702 non-null   object
 1   rr_s        1041 non-null   float64
 2   rr_t        1702 non-null   int64
 3   rr_p        1702 non-null   int64
 4   N_s         1036 non-null   float64
 5   N_t         1700 non-null   float64
 6   N_p         1696 non-null   float64
 7   saf_p_11    1696 non-null   float64
 8   com_p_11    1696 non-null   float64
 9   eng_p_11    1696 non-null   float64
 10  aca_p_11    1696 non-null   float64
 11  saf_t_11    1700 non-null   float64
 12  com_t_11    1700 non-null   float64
 13  eng_t_11    1700 non-null   float64
 14  aca_t_11    1700 non-null   float64
 15  saf_s_11    1036 non-null   float64
 16  com_s_11    1036 non-null   float64
 17  eng_s_11    1036 non-null   float64
 18  aca_s_11    1036 non-null   float64
 19  saf_tot_11  1702 non-null   float64
 20  com_tot_11  1702 non-null   float64
 21  eng_tot_11  1702 non-null   float64
 22  aca_tot_11  1702 non-null   float64
dtypes: float64(20), int64(2), object(1)
memory usage: 399.1+ KB

In [373]:
data['survey'].rename(columns={'dbn': 'DBN'}, inplace=True)

In [374]:
# merging the other stuff
combined = combined.merge(data['class_size'], on='DBN', how='inner')
combined = combined.merge(data['demographics'], on='DBN', how='inner')
combined = combined.merge(data['survey'], on='DBN', how='inner')
combined = combined.merge(data['hs_directory'], on='DBN', how='inner')

combined.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,sat_score,SchoolName,AP Test Takers,Total Exams Taken,...,priority10,Location 1,Community Board,Council District,Census Tract,BIN,BBL,NTA,lat,lon
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355.0,404.0,363.0,1122.0,NaN,NaN,NaN,...,NaN,"220 Henry Street\nNew York, NY 10002\n(40.7137...",3.0,1.0,201.0,1003223.0,1.002690e+09,Lower East Side ...,40.713764,-73.985260
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383.0,423.0,366.0,1172.0,UNIVERSITY NEIGHBORHOOD H.S.,39.0,49.0,...,NaN,"200 Monroe Street\nNew York, NY 10002\n(40.712...",3.0,1.0,202.0,1003214.0,1.002590e+09,Lower East Side ...,40.712332,-73.984797
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377.0,402.0,370.0,1149.0,EAST SIDE COMMUNITY HS,19.0,21.0,...,NaN,"420 East 12 Street\nNew York, NY 10009\n(40.72...",3.0,2.0,34.0,1005974.0,1.004390e+09,East Village ...,40.729783,-73.983041
3,01M509,MARTA VALLE HIGH SCHOOL,44,390.0,433.0,384.0,1207.0,NaN,NaN,NaN,...,NaN,"145 Stanton Street\nNew York, NY 10002\n(40.72...",3.0,1.0,3001.0,1004323.0,1.003540e+09,Chinatown ...,40.720569,-73.985673
4,01M539,"NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...",159,522.0,574.0,525.0,1621.0,"NEW EXPLORATIONS SCI,TECH,MATH",255.0,377.0,...,NaN,"111 Columbia Street\nNew York, NY 10002\n(40.7...",3.0,2.0,2201.0,1004070.0,1.003350e+09,Lower East Side ...,40.718725,-73.979426

In [375]:
combined.shape

(363, 209)

In [380]:
combined.info(verbose=True, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 363 entries, 0 to 362
Data columns (total 209 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   DBN                                   363 non-null    object
 1   SCHOOL NAME                           363 non-null    object
 2   Num of SAT Test Takers                363 non-null    object
 3   SAT Critical Reading Avg. Score       335 non-null    float64
 4   SAT Math Avg. Score                   335 non-null    float64
 5   SAT Writing Avg. Score                335 non-null    float64
 6   sat_score                             335 non-null    float64
 7   SchoolName                            228 non-null    object
 8   AP Test Takers                        208 non-null    float64
 9   Total Exams Taken                     208 non-null    float64
 10  Number of Exams with scores 3 4 or 5  140 non-null    float64
 11  Demographic                           310 non-null    object
 12  School Name                           310 non-null    object
 13  Cohort                                310 non-null    object
 14  Total Cohort                          310 non-null    float64
 15  Total Grads - n                       310 non-null    object
 16  Total Grads - % of cohort             292 non-null    float64
 17  Total Regents - n                     310 non-null    object
 18  Total Regents - % of cohort           292 non-null    float64
 19  Total Regents - % of grads            291 non-null    float64
 20  Advanced Regents - n                  310 non-null    object
 21  Advanced Regents - % of cohort        292 non-null    float64
 22  Advanced Regents - % of grads         291 non-null    float64
 23  Regents w/o Advanced - n              310 non-null    object
 24  Regents w/o Advanced - % of cohort    292 non-null    float64
 25  Regents w/o Advanced - % of grads     291 non-null    float64
 26  Local - n                             310 non-null    object
 27  Local - % of cohort                   292 non-null    float64
 28  Local - % of grads                    291 non-null    float64
 29  Still Enrolled - n                    310 non-null    object
 30  Still Enrolled - % of cohort          292 non-null    float64
 31  Dropped Out - n                       310 non-null    object
 32  Dropped Out - % of cohort             292 non-null    float64
 33  CSD_x                                 363 non-null    int64
 34  NUMBER OF STUDENTS / SEATS FILLED_x   363 non-null    float64
 35  NUMBER OF SECTIONS_x                  363 non-null    float64
 36  AVERAGE CLASS SIZE_x                  363 non-null    float64
 37  SIZE OF SMALLEST CLASS_x              363 non-null    float64
 38  SIZE OF LARGEST CLASS_x               363 non-null    float64
 39  SCHOOLWIDE PUPIL-TEACHER RATIO_x      0 non-null      float64
 40  Name_x                                363 non-null    object
 41  schoolyear_x                          363 non-null    int64
 42  fl_percent_x                          0 non-null      object
 43  frl_percent_x                         363 non-null    float64
 44  total_enrollment_x                    363 non-null    int64
 45  prek_x                                363 non-null    object
 46  k_x                                   363 non-null    object
 47  grade1_x                              363 non-null    object
 48  grade2_x                              363 non-null    object
 49  grade3_x                              363 non-null    object
 50  grade4_x                              363 non-null    object
 51  grade5_x                              363 non-null    object
 52  grade6_x                              363 non-null    object
 53  grade7_x                              363 non-null    object
 54  grade8_x                              363 non-null    object
 55  grade9_x                              363 non-null    object
 56  grade10_x                             363 non-null    object
 57  grade11_x                             363 non-null    object
 58  grade12_x                             363 non-null    object
 59  ell_num_x                             363 non-null    float64
 60  ell_percent_x                         363 non-null    float64
 61  sped_num_x                            363 non-null    float64
 62  sped_percent_x                        363 non-null    float64
 63  ctt_num_x                             363 non-null    object
 64  selfcontained_num_x                   363 non-null    object
 65  asian_num_x                           363 non-null    int64
 66  asian_per_x                           363 non-null    float64
 67  black_num_x                           363 non-null    int64
 68  black_per_x                           363 non-null    float64
 69  hispanic_num_x                        363 non-null    int64
 70  hispanic_per_x                        363 non-null    float64
 71  white_num_x                           363 non-null    int64
 72  white_per_x                           363 non-null    float64
 73  male_num_x                            363 non-null    float64
 74  male_per_x                            363 non-null    float64
 75  female_num_x                          363 non-null    float64
 76  female_per_x                          363 non-null    float64
 77  CSD_y                                 363 non-null    int64
 78  NUMBER OF STUDENTS / SEATS FILLED_y   363 non-null    float64
 79  NUMBER OF SECTIONS_y                  363 non-null    float64
 80  AVERAGE CLASS SIZE_y                  363 non-null    float64
 81  SIZE OF SMALLEST CLASS_y              363 non-null    float64
 82  SIZE OF LARGEST CLASS_y               363 non-null    float64
 83  SCHOOLWIDE PUPIL-TEACHER RATIO_y      0 non-null      float64
 84  Name_y                                363 non-null    object
 85  schoolyear_y                          363 non-null    int64
 86  fl_percent_y                          0 non-null      object
 87  frl_percent_y                         363 non-null    float64
 88  total_enrollment_y                    363 non-null    int64
 89  prek_y                                363 non-null    object
 90  k_y                                   363 non-null    object
 91  grade1_y                              363 non-null    object
 92  grade2_y                              363 non-null    object
 93  grade3_y                              363 non-null    object
 94  grade4_y                              363 non-null    object
 95  grade5_y                              363 non-null    object
 96  grade6_y                              363 non-null    object
 97  grade7_y                              363 non-null    object
 98  grade8_y                              363 non-null    object
 99  grade9_y                              363 non-null    object
 100 grade10_y                             363 non-null    object
 101 grade11_y                             363 non-null    object
 102 grade12_y                             363 non-null    object
 103 ell_num_y                             363 non-null    float64
 104 ell_percent_y                         363 non-null    float64
 105 sped_num_y                            363 non-null    float64
 106 sped_percent_y                        363 non-null    float64
 107 ctt_num_y                             363 non-null    object
 108 selfcontained_num_y                   363 non-null    object
 109 asian_num_y                           363 non-null    int64
 110 asian_per_y                           363 non-null    float64
 111 black_num_y                           363 non-null    int64
 112 black_per_y                           363 non-null    float64
 113 hispanic_num_y                        363 non-null    int64
 114 hispanic_per_y                        363 non-null    float64
 115 white_num_y                           363 non-null    int64
 116 white_per_y                           363 non-null    float64
 117 male_num_y                            363 non-null    float64
 118 male_per_y                            363 non-null    float64
 119 female_num_y                          363 non-null    float64
 120 female_per_y                          363 non-null    float64
 121 rr_s                                  363 non-null    float64
 122 rr_t                                  363 non-null    int64
 123 rr_p                                  363 non-null    int64
 124 N_s                                   360 non-null    float64
 125 N_t                                   363 non-null    float64
 126 N_p                                   363 non-null    float64
 127 saf_p_11                              363 non-null    float64
 128 com_p_11                              363 non-null    float64
 129 eng_p_11                              363 non-null    float64
 130 aca_p_11                              363 non-null    float64
 131 saf_t_11                              363 non-null    float64
 132 com_t_11                              363 non-null    float64
 133 eng_t_11                              363 non-null    float64
 134 aca_t_11                              363 non-null    float64
 135 saf_s_11                              360 non-null    float64
 136 com_s_11                              360 non-null    float64
 137 eng_s_11                              360 non-null    float64
 138 aca_s_11                              360 non-null    float64
 139 saf_tot_11                            363 non-null    float64
 140 com_tot_11                            363 non-null    float64
 141 eng_tot_11                            363 non-null    float64
 142 aca_tot_11                            363 non-null    float64
 143 dbn                                   363 non-null    object
 144 school_name                           363 non-null    object
 145 borough                               363 non-null    object
 146 building_code                         363 non-null    object
 147 phone_number                          363 non-null    object
 148 fax_number                            362 non-null    object
 149 grade_span_min                        361 non-null    float64
 150 grade_span_max                        363 non-null    int64
 151 expgrade_span_min                     0 non-null      float64
 152 expgrade_span_max                     1 non-null      float64
 153 bus                                   362 non-null    object
 154 subway                                302 non-null    object
 155 primary_address_line_1                363 non-null    object
 156 city                                  363 non-null    object
 157 state_code                            363 non-null    object
 158 postcode                              363 non-null    int64
 159 website                               363 non-null    object
 160 total_students                        363 non-null    float64
 161 campus_name                           166 non-null    object
 162 school_type                           69 non-null     object
 163 overview_paragraph                    363 non-null    object
 164 program_highlights                    362 non-null    object
 165 language_classes                      351 non-null    object
 166 advancedplacement_courses             306 non-null    object
 167 online_ap_courses                     53 non-null     object
 168 online_language_courses               55 non-null     object
 169 extracurricular_activities            363 non-null    object
 170 psal_sports_boys                      317 non-null    object
 171 psal_sports_girls                     317 non-null    object
 172 psal_sports_coed                      125 non-null    object
 173 school_sports                         257 non-null    object
 174 partner_cbo                           315 non-null    object
 175 partner_hospital                      184 non-null    object
 176 partner_highered                      344 non-null    object
 177 partner_cultural                      282 non-null    object
 178 partner_nonprofit                     271 non-null    object
 179 partner_corporate                     184 non-null    object
 180 partner_financial                     71 non-null     object
 181 partner_other                         175 non-null    object
 182 addtl_info1                           296 non-null    object
 183 addtl_info2                           191 non-null    object
 184 start_time                            362 non-null    object
 185 end_time                              362 non-null    object
 186 se_services                           363 non-null    object
 187 ell_programs                          363 non-null    object
 188 school_accessibility_description      363 non-null    object
 189 number_programs                       363 non-null    int64
 190 priority01                            363 non-null    object
 191 priority02                            285 non-null    object
 192 priority03                            184 non-null    object
 193 priority04                            118 non-null    object
 194 priority05                            29 non-null     object
 195 priority06                            12 non-null     object
 196 priority07                            2 non-null      object
 197 priority08                            0 non-null      object
 198 priority09                            0 non-null      object
 199 priority10                            0 non-null      object
 200 Location 1                            363 non-null    object
 201 Community Board                       361 non-null    float64
 202 Council District                      361 non-null    float64
 203 Census Tract                          361 non-null    float64
 204 BIN                                   360 non-null    float64
 205 BBL                                   360 non-null    float64
 206 NTA                                   361 non-null    object
 207 lat                                   363 non-null    float64
 208 lon                                   363 non-null    float64
dtypes: float64(88), int64(19), object(102)
memory usage: 605.5+ KB

## Handling Missing Values

In order to fill NaN values in the columns, I will compute the means for that column and use it to fill in.

In [385]:
# calculate the means
means = combined.mean()
# filling missing values
combined.fillna(means, inplace=True)
# fill remaining missing values with 0
combined.fillna(0,inplace=True)
combined

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,sat_score,SchoolName,AP Test Takers,Total Exams Taken,...,priority10,Location 1,Community Board,Council District,Census Tract,BIN,BBL,NTA,lat,lon
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355.0,404.0,363.0,1122.0,0,129.028846,197.038462,...,0.0,"220 Henry Street\nNew York, NY 10002\n(40.7137...",3.0,1.0,201.0,1003223.0,1.002690e+09,Lower East Side ...,40.713764,-73.985260
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383.0,423.0,366.0,1172.0,UNIVERSITY NEIGHBORHOOD H.S.,39.000000,49.000000,...,0.0,"200 Monroe Street\nNew York, NY 10002\n(40.712...",3.0,1.0,202.0,1003214.0,1.002590e+09,Lower East Side ...,40.712332,-73.984797
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377.0,402.0,370.0,1149.0,EAST SIDE COMMUNITY HS,19.000000,21.000000,...,0.0,"420 East 12 Street\nNew York, NY 10009\n(40.72...",3.0,2.0,34.0,1005974.0,1.004390e+09,East Village ...,40.729783,-73.983041
3,01M509,MARTA VALLE HIGH SCHOOL,44,390.0,433.0,384.0,1207.0,0,129.028846,197.038462,...,0.0,"145 Stanton Street\nNew York, NY 10002\n(40.72...",3.0,1.0,3001.0,1004323.0,1.003540e+09,Chinatown ...,40.720569,-73.985673
4,01M539,"NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...",159,522.0,574.0,525.0,1621.0,"NEW EXPLORATIONS SCI,TECH,MATH",255.000000,377.000000,...,0.0,"111 Columbia Street\nNew York, NY 10002\n(40.7...",3.0,2.0,2201.0,1004070.0,1.003350e+09,Lower East Side ...,40.718725,-73.979426
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
358,32K545,EBC HIGH SCHOOL FOR PUBLIC SERVICE–BUSHWICK,88,384.0,409.0,361.0,1154.0,EBC-HS FOR PUB SERVICE (BUSH),47.000000,64.000000,...,0.0,"1155 Dekalb Avenue\nBrooklyn, NY 11221\n(40.69...",4.0,34.0,393.0,3073462.0,3.032300e+09,Bushwick South ...,40.694482,-73.929154
359,32K549,BUSHWICK SCHOOL FOR SOCIAL JUSTICE,75,348.0,353.0,334.0,1035.0,0,129.028846,197.038462,...,0.0,"400 Irving Avenue\nBrooklyn, NY 11237\n(40.696...",4.0,37.0,435.0,3076908.0,3.033650e+09,Bushwick North ...,40.696962,-73.910816
360,32K552,ACADEMY OF URBAN PLANNING,67,342.0,364.0,354.0,1060.0,Academy of Urban Planning,76.000000,100.000000,...,0.0,"400 Irving Avenue\nBrooklyn, NY 11237\n(40.696...",4.0,37.0,435.0,3076908.0,3.033650e+09,Bushwick North ...,40.696962,-73.910816
361,32K554,ALL CITY LEADERSHIP SECONDARY SCHOOL,39,428.0,465.0,422.0,1315.0,All City Leadership Secondary School,7.000000,8.000000,...,0.0,"321 Palmetto Street\nBrooklyn, NY 11237\n(40.6...",4.0,37.0,433.0,3413715.0,3.033440e+09,Bushwick North ...,40.697408,-73.913153
362,32K556,BUSHWICK LEADERS HIGH SCHOOL FOR ACADEMIC EXCE...,23,347.0,358.0,350.0,1055.0,Bushwick Leaders High School for Academic Exce...,34.000000,35.000000,...,0.0,"797 Bushwick Avenue\nBrooklyn, NY 11221\n(40.6...",4.0,34.0,393.0,3073761.0,3.032420e+09,Bushwick South ...,40.694996,-73.927986

## Adding School District Column

In order to map out our analyses on school districts a column containing the first two chars of the DBN col would be preferable.

In [388]:
# define func to pull out first two chars of a string
def first_two(instr):
    return instr[0:2]

# apply to DBN
combined['school_dist'] = combined['DBN'].apply(first_two)

combined['school_dist'].head(20)

0     01
1     01
2     01
3     01
4     01
5     01
6     02
7     02
8     02
9     02
10    02
11    02
12    02
13    02
14    02
15    02
16    02
17    02
18    02
19    02
Name: school_dist, dtype: object

# Analyzing and Visualizing the Data